change script to patch the gateway api svc nodeport and update docs
